### 학습 목표

- 타이타닉 데이터를 활용해서 생존자 예측 실습을 진행
- Kaggle 사이트에 결과를 제출하여 높은 점수를 받는게 목표
- 데이터를 전처리하는 기법에 대해 학습

# 머신러닝 과정

- 1. 문제를 정의
- 2. 데이터 수집
- 3. 데이터 전처리
- 4. EDA(탐색적 데이터 분석) -> 특성 선택, 특성 삭제
- 5. 모델 선택및 하이퍼파라미터 조정
- 6. 모델 예측 및 평가

In [1]:
# 1. 문제 정의
# -> 타이타닉 생존자를 예측해서 Kaggle에 참여한다.

# 2. 데이터 수집
# -> Kaggle에서 제공

In [3]:
# 라이브러리 불러오기

# 데이터 공학(전처리)를 위해서 사용
import numpy as np
import pandas as pd

# 데이터 시각화를 위해서 사용
# matplotlib의 단점 : 설정의 자유도가 높지만, 반대로 설정해야하는 내용들이 너무 많다.
# ->  우리는 데이터 시가화를 간단히 하고 싶다. 기본적으로 꾸며져있는 시각화 라이브러리가 필요하다.
# -> 그래서 seaborn이 만들어짐
import matplotlib.pyplot as plt
import seaborn as sns

In [63]:
# 데이터 불러오기

train = pd.read_csv('data/train.csv')
test = pd.read_csv('data/test.csv')

In [67]:
# 5개의 데이터를 샘플링

# set_index(), pd.read_csv('파일명' index_col = '원하는 컬럼명')
# train 데이터프레임에서 PassengerId를 인덱스로 설정
# set_index는 바뀐 결과물만 보여주고, 원본 데이터에는 영향 X
# inplace = True -> 원본 데이터에 영향 O
# train = train.set_index('PassengerId', drop=True)

# 상위 5개 행 출력


#train.loc[:,'PassengerId'] == 892

train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [46]:
test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [33]:
# 타이타닉 데이터 컬럼 설명
# Pclass : 티켓의 등급
# SibSp : 배우자와 형제수
# Parch : 자식과 부모를 합친 수
# Fare : 티켓의 요금
# Embarked : 탑승항
# Survived(정답) : 탑승자가 생존했는지 유무

In [34]:
# 데이터 확인
# 1. train과 test의 차이점
# 결측치가 존재한다!
# 2. train과 test 각각의 문제점
# train : Age, Cabin, Embarked에 결측치가 존재한다!
# test : Age, Fare, Cabine에 결측치가 존재한다!